const taskdata = [
    {
        "name": "Таракан на стене",
        "condition": "В ваш подъезд двумя этажами ниже въехали новые жильцы, которые привезли с собой тараканов, но не привезли еды. Насекомые в поисках еды стали ползти вверх по вентиляционной шахте и скоро доберутся до вашей квартиры. Но карабкаться вверх им неудобно: за час они поднимаются на 1 м, но сразу после этого теряют равновесие и скатываются на ⅔ м вниз. Вопрос: сколько часов у вас есть на покупку ловушек для тараканов, если расстояние от вас до соседей по вентиляционной шахте — 7 м?",
        "answer": "19 часов, девятнадцать",
        "rating": "4",
        "tags" : "тараканнастене,таракан,стена,подъезд,жильцы,шахта"
    },

    {
        "name": "Полторы белки",
        "condition": "Полторы белки за полторы минуты съедают полтора ореха. Сколько орехов съедят 9 белок за 9 минут?",
        "answer": "54 ореха, пятьдесят четыре",
        "rating": "5",
        "tags" : "полторыбелки,полторы,белка,орех,9минут"
    },
    {
        "name": "Рекрутер и бесконечный офис",
        "condition": "В одной крупной компании появился безумный рекрутер, который нанимал на работу только джуниоров. У него был хитрый план — заполнить ими весь офис и получить за это премию от начальства. Чтобы это сделать, он каждый день нанимал столько же людей, сколько уже работает в офисе. Грубо говоря, удваивал число джуниоров. Когда он только начинал, в старом офисе работал только один джуниор, но 30 дней спустя все рабочие места в офисе были полностью заняты напуганными, ничего не понимающими джуниорами. В новом, точно таком же по размеру офисе с первого дня работает в 2 раза больше людей, чем на старте в старом — целых 2 джуниора вместо одного. Сколько времени уйдёт у безумного рекрутера на то, чтобы заполнить новый офис и получить свою квартальную премию?",
        "answer": "29 дней",
        "rating": "3",
        "tags" : "рекрутерибесконечныйофис,рекрутер,офис,джуниор,джун,работа,найм"
    },
    {
        "name": "Популярная школьная задача",
        "condition": "Вот вам очень простой математический пример: 8 / 2(2 + 2) Вы удивитесь, но большинство людей не смогут правильно это посчитать. Посчитайте сами и потом смотрите правильный ответ",
        "answer": "16, шестнадцать",
        "rating": "2",
        "tags" : "популярнаяшкольнаязадача,школьнаая,задача,математика,пример"
    },
    {
        "name": "Программисты и часы",
        "condition": "— Доброе утро. Который сейчас час? — Сложи ¼ времени, прошедшего с полуночи до сейчас, с ½ от сейчас до полуночи. — Спасибо, я понял. — Не сомневался. Вопрос: который час?",
        "answer": "9:36, 9 часов 36 минут, 9 36",
        "rating": "4",
        "tags" : "программистыивремя,программисты,время,которыйчас"
    },
    {
        "name": "Необычный автосалон",
        "condition": "Один автосалон купил подержанную машину за 450 тысяч и через неделю продал её за 525 тысяч. Директор салона решил, что такая модель пользуется спросом, так что он дал менеджерам задание — найти ещё одну подобную машину. Они нашли такую же за 550 тысяч, купили её, но директор повёл себя странно. Он снова поставил на неё ценник в 525 тысяч, и машина ушла за два дня. Помогите бухгалтерии понять, заработал в итоге салон или потерял часть денег?",
        "answer": "50 тысяч, пятьдесят тывсяч",
        "rating": "4",
        "tags" : "необычныйавтосалон,автосалон,машина,доход,директор"
    },
    {
        "name": "",
        "condition": "",
        "answer": "",
        "rating": "",
        "tags" : ""
    },
    {
        "name": "",
        "condition": "",
        "answer": "",
        "rating": "",
        "tags" : ""
    },
    {
        "name": "",
        "condition": "",
        "answer": "",
        "rating": "",
        "tags" : ""
    },
    {
        "name": "",
        "condition": "",
        "answer": "",
        "rating": "",
        "tags" : ""
    },
]
    
module.exports = taskdata
