const taskdata = [
    {
        "name": "Таракан на стене",
        "condition": "В ваш подъезд двумя этажами ниже въехали новые жильцы, которые привезли с собой тараканов, но не привезли еды. Насекомые в поисках еды стали ползти вверх по вентиляционной шахте и скоро доберутся до вашей квартиры. Но карабкаться вверх им неудобно: за час они поднимаются на 1 м, но сразу после этого теряют равновесие и скатываются на ⅔ м вниз.   Вопрос: сколько часов у вас есть на покупку ловушек для тараканов, если расстояние от вас до соседей по вентиляционной шахте — 7 м?",
        "answer": "19 часов",
        "rating": "4",
        "tags" : ""
    },

    {
        "name": "",
        "condition": "",
        "answer": "",
        "rating": "",
        "tags" : ""
    },
]
    
module.exports = taskdata
