[
    {
        "id": 1,
        "name": "Таракан на стене",
        "condition": "В ваш подъезд двумя этажами ниже въехали новые жильцы, которые привезли с собой тараканов, но не привезли еды. Насекомые в поисках еды стали ползти вверх по вентиляционной шахте и скоро доберутся до вашей квартиры. Но карабкаться вверх им неудобно: за час они поднимаются на 1 м, но сразу после этого теряют равновесие и скатываются на ⅔ м вниз. Вопрос: сколько часов у вас есть на покупку ловушек для тараканов, если расстояние от вас до соседей по вентиляционной шахте — 7 м?",
        "answer": "19 часов, девятнадцать",
        "rating": "4",
        "tags": "тараканнастене,таракан,стена,подъезд,жильцы,шахта",
        "createdAt": "2021-10-07T15:12:07.410Z",
        "updatedAt": "2021-10-07T15:12:07.410Z",
        "userId": 1
    },
    {
        "id": 2,
        "name": "Полторы белки",
        "condition": "Полторы белки за полторы минуты съедают полтора ореха. Сколько орехов съедят 9 белок за 9 минут?",
        "answer": "54 ореха, пятьдесят четыре",
        "rating": "5",
        "tags": "полторыбелки,полторы,белка,орех,9минут",
        "createdAt": "2021-10-07T15:12:07.601Z",
        "updatedAt": "2021-10-07T15:12:07.601Z",
        "userId": 1
    },
    {
        "id": 3,
        "name": "Рекрутер и бесконечный офис",
        "condition": "В одной крупной компании появился безумный рекрутер, который нанимал на работу только джуниоров. У него был хитрый план — заполнить ими весь офис и получить за это премию от начальства. Чтобы это сделать, он каждый день нанимал столько же людей, сколько уже работает в офисе. Грубо говоря, удваивал число джуниоров. Когда он только начинал, в старом офисе работал только один джуниор, но 30 дней спустя все рабочие места в офисе были полностью заняты напуганными, ничего не понимающими джуниорами. В новом, точно таком же по размеру офисе с первого дня работает в 2 раза больше людей, чем на старте в старом — целых 2 джуниора вместо одного. Сколько времени уйдёт у безумного рекрутера на то, чтобы заполнить новый офис и получить свою квартальную премию?",
        "answer": "29 дней",
        "rating": "3",
        "tags": "рекрутерибесконечныйофис,рекрутер,офис,джуниор,джун,работа,найм",
        "createdAt": "2021-10-07T15:12:07.788Z",
        "updatedAt": "2021-10-07T15:12:07.788Z",
        "userId": 1
    }
]